import { HomeKey } from './keys';

export const el = {
    [HomeKey.title]: "Aquamarine",
    [HomeKey.subtitle]: "Frontend Engineer · Polyglot",
    [HomeKey.description]: "Κυρίως αναπτύσσω frontend με <strong>React</strong> και <strong>Vue</strong>, με εξειδίκευση στη σχεδίαση στοιχείων, τη διαχείριση κατάστασης και τις μηχανικές πρακτικές, εστιάζοντας στη βελτίωση της διαδραστικότητας της διεπαφής και της απόδοσης φόρτωσης.",
    [HomeKey.description2]: "Πέρα από τη μηχανική, είμαι ικανός σε πολλές γλώσσες, κατέχοντας πιστοποιήσεις <strong>JLPT N1</strong> και <strong>TOPIK 6</strong>, επιτρέποντας την ομαλή διαπολιτισμική επικοινωνία και τη συνεργασία σε διεθνείς ομάδες.",
    [HomeKey.readBlog]: "Διαβάστε το Blog",
    [HomeKey.viewDocs]: "Οδηγοί",
    [HomeKey.techStack]: "Τεχνολογία & Μηχανική",
    [HomeKey.techDesc]: "Αποδόμηση σύνθετης λογικής μέσω κομψού κώδικα και μεταφορά αισθητηριακής αντήχησης μέσω εκλεπτυσμένου σχεδιασμού. Αφοσίωση στην οπτική ακρίβεια pixel, την απόλυτη απόδοση φόρτωσης και την προσβασιμότητα, δημιουργώντας ψηφιακά προϊόντα μεταξύ τεχνολογίας και αισθητικής.",
    [HomeKey.languages]: "Γλώσσες & Ορίζοντες",
    [HomeKey.langDesc]: "Η γλώσσα είναι το δοχείο της σκέψης και μια γέφυρα πολιτισμών. Πέρα από τα τεχνολογικά όρια, εξερευνώ τις ποικίλες αφηγήσεις του κόσμου μέσω πολλών γλωσσών, χτίζοντας γέφυρες επικοινωνίας που συνδέουν ανθρώπους και ιδέες σε παγκόσμιο επίπεδο.",
    [HomeKey.native]: "Κινεζικά (Μητρική)",
    [HomeKey.english]: "Αγγλικά (Επαγγελματικά)",
    [HomeKey.japanese]: "Ιαπωνικά (JLPT N1)",
    [HomeKey.korean]: "Κορεάτικα (TOPIK 6)",
    [HomeKey.design]: "Frontend Design"
};
