import { HomeKey } from './keys';

export const ru = {
    [HomeKey.title]: "Aquamarine",
    [HomeKey.subtitle]: "Frontend-инженер · Полиглот",
    [HomeKey.description]: "В основном занимаюсь фронтенд-разработкой на <strong>React</strong> и <strong>Vue</strong>, специализируюсь на компонентном дизайне, управлении состоянием и инженерных практиках с акцентом на улучшение интерактивности интерфейса и производительности загрузки.",
    [HomeKey.description2]: "Помимо инженерной практики, я владею несколькими языками и имею сертификаты <strong>JLPT N1</strong> и <strong>TOPIK 6</strong>, что позволяет мне свободно общаться и координировать проекты в международных командах.",
    [HomeKey.readBlog]: "Читать блог",
    [HomeKey.viewDocs]: "Руководства",
    [HomeKey.techStack]: "Инженерия и технологии",
    [HomeKey.techDesc]: "Деконструкция сложной логики с помощью элегантного кода и передача чувственного резонанса через изысканный дизайн. Стремление к пиксельной точности, максимальной производительности загрузки и доступности интерфейсов на стыке технологий и эстетики.",
    [HomeKey.languages]: "Языки и кругозор",
    [HomeKey.langDesc]: "Язык — это сосуд мысли и мост между культурами. За пределами технологических границ я исследую многообразие мира с помощью языков, выстраивая каналы коммуникации для обмена глубокими идеями в глобальном масштабе.",
    [HomeKey.native]: "Китайский (Носитель)",
    [HomeKey.english]: "Английский (Профессиональный)",
    [HomeKey.japanese]: "Японский (JLPT N1)",
    [HomeKey.korean]: "Корейский (TOPIK 6)",
    [HomeKey.design]: "Frontend-дизайн"
};
